In [1]:
from IPython.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("./data_dir/Employee_dataset/Employee.csv")

In [4]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

In [5]:
df.shape

(4653, 9)

In [ ]:
df.sort_values({
    "by": "JoiningYear", 
})

In [6]:
df1 = pd.DataFrame(np.random.randint(1, 5, (10,2)), columns=['a','b'])

In [7]:
df1

   a  b
0  4  3
1  3  4
2  4  4
3  1  1
4  3  2
5  2  2
6  3  2
7  1  4
8  4  1
9  4  2

In [12]:
df1.sort_values(by=['a', 'b'], ascending=[True, False])

   a  b
7  1  4
3  1  1
5  2  2
1  3  4
4  3  2
6  3  2
2  4  4
0  4  3
9  4  2
8  4  1

In [16]:
np.arange(1,10,1).reshape(-1,1)

array([[1],
       [2],
       [3],
       [4],
       [5],
       [6],
       [7],
       [8],
       [9]])

In [11]:
np.random.randint(1, 5, (10,2,4))

array([[[2, 4, 1, 1],
        [1, 3, 3, 2]],

       [[3, 3, 4, 2],
        [2, 2, 4, 1]],

       [[4, 2, 3, 4],
        [3, 3, 4, 3]],

       [[3, 3, 1, 3],
        [4, 4, 3, 1]],

       [[3, 1, 4, 4],
        [3, 1, 4, 3]],

       [[1, 3, 4, 2],
        [2, 1, 1, 3]],

       [[4, 3, 2, 3],
        [2, 1, 3, 1]],

       [[1, 4, 4, 4],
        [3, 3, 2, 4]],

       [[1, 3, 4, 1],
        [4, 2, 2, 1]],

       [[4, 3, 1, 2],
        [4, 2, 3, 3]]])

In [3]:
left = pd.DataFrame({"A": [1, 2], "B": [2, 2]})
right = pd.DataFrame({"A": [4, 5, 6], "B": [2, 2, 2]})

In [8]:
left

   A  B
0  1  2
1  2  2

In [9]:
right

   A  B
0  4  2
1  5  2
2  6  2

In [10]:
pd.merge(left, right, on="B", how="outer", suffixes=("_left"))

   A_x  B  A_y
0    1  2    4
1    1  2    5
2    1  2    6
3    2  2    4
4    2  2    5
5    2  2    6